<?php
/**
 * Created by PhpStorm.
 * User: pc
 * Date: 2014/12/10
 * Time: 10:39
 */

namespace common\exceptions;


class InvestException extends UserExceptionExt{

    public static $ERROR_MSG = array(

        // 支付相关
        "1301" => "支付证书配置错误",

        // 短信发送
        "1401" => "用户太多",
        "1402" => "没有合法用户",
        "1403" => "Http请求失败",
        "1404" => "短信网关报错",

        /* 支付异常错误码 */
        "2000" => "绑卡跳转SDK",       // 连连支付 - 支付0.01绑卡
        "2001" => "支付需要验证码",    // 联动支付
        "2002" => "支付跳转SDK",      // 连连支付 - 支付金额投资
        "2003" => "预留支付",
        "2004" => "预留支付",
        "2005" => "预留支付",
        "2006" => "预留支付",
        "2007" => "预留支付",
        "2008" => "预留支付",
        "2009" => "预留支付",
    );
}