<?php
/**
 * Created by PhpStorm.
 * User: pc
 * Date: 2014/12/25
 * Time: 14:16
 */

namespace common\exceptions;


class PayException extends UserExceptionExt
{
    public static $ERROR_MSG = [
        /* 支付异常错误码 */
        "2000" => "绑卡跳转SDK",       // 连连支付 - 支付0.01绑卡
        "2001" => "支付需要验证码",    // 联动支付
        "2002" => "充值支付跳转SDK",       // 连连支付 - 支付金额投资
        "2003" => "预留支付",  // 连连支付 - 只能使用余额支付
        "2004" => "预留支付",
        "2005" => "预留支付",
        "2006" => "预留支付",
        "2007" => "预留支付",
        "2008" => "预留支付",
        "2009" => "预留支付",

        "2100" => "暂时不支持该银行",
        "2101" => "不支持的第三方支付",
        "2102" => "用户参数不合法",
        "2103" => "请提供订单号",
        "2104" => "返回参数无法解析",
        "2105" => "提现请求非法",
        "2106" => "您尚未绑卡，无法提现",
        "2107" => "未找到提现记录",
        "2108" => "可用银行列表为空",
        "2109" => "抱歉，请重新进行充值操作",
        "2110" => "抱歉，成功金额不一致",
        "2111" => "银行预留手机号有误",


        // 连连支付相关
        "2200" => "订单时间格式错误",
        "2201" => "商户号不正确",
        "2202" => "支付成功，但找不到对应记录",
        "2203" => "支付失败",
        "2204" => "支付成功，但找不到对应用户",
        "2205" => "您还没有绑定银行卡",
        "2206" => "您银行卡暂不支持充值",
        "2207" => "申请充值失败，请稍后重试",
        "2208" => "只能使用余额支付，请先充值",
        "2220" => "不存在的充值订单号",
        "2221" => "请输入正确的金额",
        "2222" => "金额过大",
        "2223" => "充值成功，但更新用户账户失败",
        "2224" => "充值尚未成功，请耐心等待",
        "2225" => "证书配置错误",
        "2226" => "订单信息错误",
        "2227" => "提现申请失败",
        "2228" => "提现状态非法失败",
        "2229" => "找不到对账文件",
        "2230" => "请输入正确的银行编号",
        "2231" => "请输入支付密码",
        "2232" => "该订单已经处理过",
        "2233" => "请重新充值",


        // 联动支付相关
        "2321" => "请输入正确的金额",
        "2322" => "金额过大",
        "2323" => "请求支付失败，请稍后重试",
        "2324" => "订单ID必须4-16位",
        "2325" => "银行配置有误",
        "2326" => "发送验证码失败",
        "2327" => "验证码输入错误",
        "2328" => "订单写入失败",
        "2329" => "支付失败",
        "2330" => "绑卡失败",
        "2331" => "您的卡号、身份证、预留手机验证不通过（如预留手机与注册手机号不一致，可致电021-80260891）",
        "2332" => "您已绑定过此卡，需重新填写",
        "2334" => "银行卡号填写错误",
        "2335" => "本平台最多支持6张银行卡",
        "2336" => "订单用户ID和充值回调不匹配",
        "2337" => "银行维护中",
        '2338' => '绑卡失败，绑卡唯一识别号不正确',
            
        "3001" => "银行卡余额不足",
        "3002" => "交易银行不支持或金额超限",
            
        
        // 提现相关
        "2401" => "该用户没有绑定银行卡",
        "2402" => "系统没有相关银行的配置",

        "0035" => "an error happen",
        
        // 充值出现错误，第三方返回错误码
        '00080537' => [     //老联动
            'info' => '此银行卡余额不足，请使用其他银行卡',
            'msg'  => '银行卡余额不足；',
        ],  
        '00060340' => [
            'info' => '支付金额已超上限，请调整金额后重试',
            'msg'  => '支付金额超出上限；',
        ],
        '00080550' => [
            'info' => '支付受限，请使用其他银行卡，或联系发卡银行',
            'msg'  => '支付受限，请换卡支付；',
        ],
        '00080559' => [
            'info' => '此银行卡支付失败，请使用其他银行卡',
            'msg'  => '请使用其他银行卡；',
        ],
        '00210077' => [
            'info' => '支付金额超过银行卡当日限额，请使用其他银行卡，或联系发卡银行',
            'msg'  => '消费金额超限；',
        ],
        '00253035' => [
            'info' => '您当日交易额已达上限，请于明日完成交易',
            'msg'  => '当日交易额超限；',
        ],
        '00253026' => [
            'info' => '支付金额已超上限，请调整金额后重试',
            'msg'  => '支付金额超出上限；',
        ],
        '00253023' => [
            'info' => '支付金额已超上限，请调整金额后重试',
            'msg'  => '支付金额超出上限；',
        ],
        '00200073' => [
            'info' => '此银行卡支付失败，请使用其他银行卡，或联系发卡银行',
            'msg'  => '卡信息验证失败；',
        ],
        '00255999' => [
            'info' => '请确认交易信息正确，或联系客服',
            'msg'  => '请确认交易信息是否正确；',
        ],
        '00200006' => [
            'info' => '支付验证码输入有误，请重新输入或发送验证码',
            'msg'  => '短信验证码错误；',
        ],
        '00060550' => [
            'info' => '此银行卡支付失败，请使用其他银行卡，或联系发卡银行',
            'msg'  => '此银行卡支付失败；',
        ],
        
        '00060781' => [
            'info' => '支付已成功，无须再次支付',
            'msg'  => '支付已成功，无须再次支付；',
        ],
        '600102'   => [
            'info' => '此银行卡余额不足，请使用其他银行卡', 
            'msg'  => '银行卡余额不足；',
        ],
        '600045'   => [
            'info' => '支付金额已超上限，请调整金额后重试',
            'msg'  => '支付金额超出上限；',
        ],
        '600046'   => [
            'info' => '此银行卡已达本月支付上限，请使用其他银行卡支付',
            'msg'  => '已达单月支付上限，请换卡支付',
        ],
        '600048'   => [
            'info' => '此银行卡已超当月支付次数，请使用其他银行卡，或联系发卡银行',
            'msg'  => '银行卡超过当月支付次数上限'
        ],
        '600053'   => [
            'info' => '该银行卡无法支付，请使用其他银行卡，或联系发卡银行',
            'msg'  => '暂不支持改卡，请使用其他银行卡；',
        ],
        '600098'   => [
            'info' => '消费金额超限，请联系发卡银行',
            'msg'  => '消费金额超限；',
        ],
        '601030'   => [
            'info' => '交易存在限制，无法完成支付', 
            'msg'  => '交易受限，请使用其他银行卡；',
        ],
        '600100'   => [
            'info' => '此银行卡交易受限，请使用其他银行卡，或联系发卡银行',
            'msg'  => '交易受限，请使用其他银行卡；',
        ],
        '600047'   => [
            'info' => '单卡超过单日累积支付次数上限',
            'msg'  => '单日支付次数超限；',
        ],
        
        
        // 后加
        '601037' => [
            'info' => '银行预留手机号有误',
        ],
        '600116' => [
            'info' => '短信验证码错误',
        ],
        
        
        '9999'     => [
            'info' => '交易进行中，请稍后确认',
            'msg'  => '交易进行中，请稍后确认；',
        ],
    ];
    
    
    //错误提示优化@高慧
    public static $ERR_MSG_TO_NEW = [
            //绑卡错误提示优化
            '银行预留手机号有误' => '请填写正确的银行预留手机号',
            '卡信息验证失败，请确认卡信息是否正确' => '银行预留手机号有误或卡号与姓名不符',
            '不支持此卡，请换卡' => '不支持此卡，请检查卡号是否有误',
            '鉴证失败：身份、姓名或者银行预留手机号有误' => '银行预留手机号有误或卡号与姓名不符',
            '卡bin校验失败' => '不支持此卡，请检查卡号是否有误',
            '绑卡短信验证码校验错误' => '短信验证码有误，请输入正确验证码',
            '银行预留手机号有误' => '请填写正确的银行预留手机号',
            
            //充值错误提示优化
            '支付失败' => '支付失败，请联系在线客服',
            '可用余额不足，请联系发卡银行' => '卡内余额不足，请您核实后再支付',
            '消费金额超限，请联系发卡银行' => '消费金额超出银行限制，大额消费请选择大额充值',
            '验证失败，请重新输入' => '短信验证码输入错误',
            '亲，您的账户余额不足，请您核实后再来交易' => '卡内余额不足，请您核实后再支付',
            '银行系统异常' => '支付失败，请联系在线客服',
            
    ];
    
    public static function newErrorTips($err_msg) {
        
        foreach (self::$ERR_MSG_TO_NEW as $key => $val) {
            if(mb_strstr($err_msg, $key)) {
                return $val;
            }
        }
        
        return $err_msg;
    }
    
    
    /**
     * 获取充值错误
     * @param array $errors (第三方错误对应于我们的错误码数组)
     * @param unknown $error_code (第三方错误码)
     */
    public static function getChargeError($errors, $err_code) {
        
        $ret = [];
        
        if(isset($errors[$err_code])) {//错误码是否存在
            $code = $errors[$err_code];
            
            $ret['err_code'] = $code;
            $ret['err_msg'] = self::$ERROR_MSG[$code];
        }
        else {//统一错误
            
            $ret['err_code'] = '2203';
            $ret['err_msg'] = self::$ERROR_MSG['2203'];
        }
        
        return $ret;
    }
    
} 