<?php
namespace common\models;

use Yii;
use yii\behaviors\TimestampBehavior;
use yii\db\ActiveRecord;

class LoanPersonBadInfo extends  ActiveRecord
{

    //全部
    public static $all_code = [
		''=>'所有结果项',
		'D1-01'=>'D1-01',
		'D1-02'=>'D1-02',
		'D1-03'=>'D1-03',
		'D1-04'=>'D1-04',
		'D1-05'=>'D1-05',
		'D1-06'=>'D1-06',
		'D1-07'=>'D1-07',
		'D1-08'=>'D1-08',
		'D1-09'=>'D1-09',
		'D1-10'=>'D1-10',
		'D1-11'=>'D1-11',
		'D2-01'=>'D2-01',
		'D2-02'=>'D2-02',
		'D2-03'=>'D2-03',
		'D2-04'=>'D2-04',
		'D2-05'=>'D2-05',
		'D2-06'=>'D2-06',
		'D2-07'=>'D2-07',
		'D2-08'=>'D2-08',
		'D2-09'=>'D2-09',
		'D2-10'=>'D2-10',
		'D2-11'=>'D2-11',
		'D2-12'=>'D2-12',
		'D2-13'=>'D2-13',
        'D2-14'=>'D2-14',
        'D2-15'=>'D2-15',
        'D2-16'=>'D2-16',
        'D2-17'=>'D2-17',
        'D2-18'=>'D2-18',
        'D2-19'=>'D2-19',
        'D2-20'=>'D2-20',
        'D2-21'=>'D2-21',
        'D2-22'=>'D2-22',
        'D2-23'=>'D2-23',
        'D2-24'=>'D2-24',
		'D2-25'=>'D2-25',
		'D3-01'=>'D3-01',
		'D3-02'=>'D3-02',
		'D3-03'=>'D3-03',
		'D3-04'=>'D3-04',
		'D3-05'=>'D3-05',
		'D3-06'=>'D3-06',
		'D3-07'=>'D3-07',
		'D3-08'=>'D3-08',
		'D3-09'=>'D3-09',
		'D3-10'=>'D3-10',
		'D3-11'=>'D3-11',
		'A1-01'=>'A1-01',
		'A1-02'=>'A1-02',
		'A1-03'=>'A1-03',
		'A1-04'=>'A1-04',
		'A1-05'=>'A1-05',
		'A1-06'=>'A1-06',
		'A2-01'=>'A2-01',
		'A2-02'=>'A2-02',
		'A2-03'=>'A2-03',
		'A3-01'=>'A3-01',
		'A3-02'=>'A3-02',
		'A3-03'=>'A3-03',
		'A4-01'=>'A4-01',
	];

    //拒绝码
    public static $reject_code = [
        'D1'=>[
            'id'=>'D1',
            'backend_name'=>'信用类',
            'frontedn_name'=>'信用类',
            'child'=>[
                '01'=>['id'=>'01','backend_name'=>'黑名单风险','frontedn_name'=>'信用评分不符合要求'],
                '02'=>['id'=>'02','backend_name'=>'负面信息提示','frontedn_name'=>'信用评分不符合要求'],
                '03'=>['id'=>'03','backend_name'=>'信用不良类——征信记录提示当前逾期','frontedn_name'=>'信用评分不符合要求'],
                '04'=>['id'=>'04','backend_name'=>'信用不良类——征信记录提示历史逾期','frontedn_name'=>'信用评分不符合要求'],
                '05'=>['id'=>'05','backend_name'=>'潜在信用风险——贷款笔数或贷款总金额异常','frontedn_name'=>'信用评分不符合要求'],
                '06'=>['id'=>'06','backend_name'=>'潜在信用风险——信贷机构查询次数异常','frontedn_name'=>'信用评分不符合要求'],
                '07'=>['id'=>'07','backend_name'=>'灰名单风险无法排除','frontedn_name'=>'信用评分不符合要求'],
                '08'=>['id'=>'08','backend_name'=>'负面信息提示-须备注原因','frontedn_name'=>'信用评分不符合要求'],
                '09'=>['id'=>'09','backend_name'=>'第三方历史逾期严重','frontedn_name'=>'信用评分不符合要求'],
                '10'=>['id'=>'10','backend_name'=>'信用分不足','frontedn_name'=>'信用评分不符合要求'],
                '11'=>['id'=>'11','backend_name'=>'欺诈分过高','frontedn_name'=>'信用评分不符合要求'],
            ],
            'active' => ['08', '09']
        ],
        'D2'=>[
            'id'=>'D2',
            'backend_name'=>'资格类',
            'frontedn_name'=>'资格类',
            'child'=>[
                '01'=>['id'=>'01','backend_name'=>'年龄过大或过小(20-35)','frontedn_name'=>'基本资格不符合要求'],
                '02'=>['id'=>'02','backend_name'=>'非准入城市','frontedn_name'=>'基本资格不符合要求'],
                '03'=>['id'=>'03','backend_name'=>'禁止准入单位 ','frontedn_name'=>'基本资格不符合要求'],
                '04'=>['id'=>'04','backend_name'=>'未进行征信测评或征信信息不全','frontedn_name'=>'未进行征信测评或征信信息不全'],
                '05'=>['id'=>'05','backend_name'=>'学历过低 ','frontedn_name'=>'基本资格不符合要求'],
                '06'=>['id'=>'06','backend_name'=>'非单位邮箱 ','frontedn_name'=>'基本资格不符合要求'],
//                '06'=>['id'=>'06','backend_name'=>'非单位邮箱 ','frontedn_name'=>'基本资格不符合要求'],
                '07'=>['id'=>'07','backend_name'=>'身份证照片不清晰','frontedn_name'=>'身份证照片不清晰'],
                '08'=>['id'=>'08','backend_name'=>'单位电话无法核实','frontedn_name'=>'单位电话无法核实'],
                '09'=>['id'=>'09','backend_name'=>'通讯录异常-号码过少、无效号码占比过多等','frontedn_name'=>'基本资格不符合要求'],
                '10'=>['id'=>'10','backend_name'=>'身份证照片无效-不完整、不清晰、已过期等','frontedn_name'=>'基本资格不符合要求'],
                '11'=>['id'=>'11','backend_name'=>'催收建议不通过','frontedn_name'=>'基本资格不符合要求'],
                '12'=>['id'=>'12','backend_name'=>'逾期天数不符合要求','frontedn_name'=>'基本资格不符合要求'],
                '13'=>['id'=>'13','backend_name'=>'身份证照片数量过少','frontedn_name'=>'身份证照片数量过少'],
                '14'=>['id'=>'14','backend_name'=>'借款金额过低','frontedn_name'=>'基本资格不符合要求'],
                '15'=>['id'=>'15','backend_name'=>'用户和订单来源不一致','frontedn_name'=>'基本资格不符合要求'],
                '16'=>['id'=>'16','backend_name'=>'命中准入规则','frontedn_name'=>'基本资格不符合要求'],
                '17'=>['id'=>'17','backend_name'=>'历史逾期（宜信）90天','frontedn_name'=>'基本资格不符合要求'],
                '18'=>['id'=>'18','backend_name'=>'后台历史还款逾期10天以上','frontedn_name'=>'基本资格不符合要求'],
                '19'=>['id'=>'19','backend_name'=>'互通过的电话数量小于5个','frontedn_name'=>'基本资格不符合要求'],
                '20'=>['id'=>'20','backend_name'=>'第一，第二联系人都没有过联系','frontedn_name'=>'基本资格不符合要求'],
                '21'=>['id'=>'21','backend_name'=>'人脸识别分低于50','frontedn_name'=>'基本资格不符合要求'],
                '22'=>['id'=>'22','backend_name'=>'连续关机天数>5','frontedn_name'=>'基本资格不符合要求'],
                '23'=>['id'=>'23','backend_name'=>'月均话费小于10元','frontedn_name'=>'基本资格不符合要求'],
                '24'=>['id'=>'24','backend_name'=>'7天内提前还款2次及以上','frontedn_name'=>'基本资格不符合要求'],
                '25'=>['id'=>'25','backend_name'=>'存在多笔进行中订单','frontedn_name'=>'基本资格不符合要求'],
                '26'=>['id'=>'26','backend_name'=>'注册号码与第一、第二联系人存在相同项','frontedn_name'=>'基本资格不符合要求'],
                '27'=>['id'=>'27','backend_name'=>'身份证号码小于18位'],
            ],
            'active' => ['09', '10']
        ],
        'D3'=>[
            'id'=>'D3',
            'backend_name'=>'电核异常类（欺诈风险）',
            'frontedn_name'=>'电核异常类（欺诈风险）',
            'child'=>[
                '01'=>['id'=>'01','backend_name'=>'交叉验证失败——无法排除疑点或口径不一致','frontedn_name'=>'综合评分不足'],
                '02'=>['id'=>'02','backend_name'=>'疑似伪冒——联系到本人否认申请','frontedn_name'=>'综合评分不足'],
                '03'=>['id'=>'03','backend_name'=>'关键信息无效——手机号（空号、错误）、单位邮箱、单位地址无法核实上，且联系人信息无法核实','frontedn_name'=>'综合评分不足'],
                '04'=>['id'=>'04','backend_name'=>'核身失败——生日、身份证号码等无法核实上','frontedn_name'=>'综合评分不足'],
                '05'=>['id'=>'05','backend_name'=>'电核时客户已离职','frontedn_name'=>'综合评分不足'],
                '06'=>['id'=>'06','backend_name'=>'电核时单位无此人','frontedn_name'=>'综合评分不足'],
                '07'=>['id'=>'07','backend_name'=>'疑似通过代办公司申请——本人通过非法中介包装个人信息代办','frontedn_name'=>'综合评分不足'],
                '08'=>['id'=>'08','backend_name'=>'填写信息虚假-地址、单位、联系人等','frontedn_name'=>'综合评分不足'],
                '09'=>['id'=>'09','backend_name'=>'电核异常/关键信息无效-手机号（空号、错误、停机、关机），且联系人无法核实','frontedn_name'=>'综合评分不足'],
                '10'=>['id'=>'10','backend_name'=>'电核异常/交叉验证失败-无法排除疑点或口径不一致','frontedn_name'=>'综合评分不足'],
                '11'=>['id'=>'11','backend_name'=>'电核异常/工作信息虚假-电核时单位无此人、已离职、已开除等','frontedn_name'=>'综合评分不足'],
            ],
            'active' => ['08', '09', '10', '11']
        ],
    ];

    //通过码
    public static $pass_code = [
        'A1'=>[
            'id'=>'A1',
            'backend_name'=>'正常通过',
            'frontedn_name'=>'正常通过',
            'child'=>[
                '01'=>['id'=>'01','backend_name'=>'与第三方信息一致，免电核通过','frontedn_name'=>'审核通过'],
                '02'=>['id'=>'02','backend_name'=>'无第三方信息，电核通过','frontedn_name'=>'审核通过'],
                '03'=>['id'=>'03','backend_name'=>'与第三方信息不一致，电核通过','frontedn_name'=>'审核通过'],
                '04'=>['id'=>'04','backend_name'=>'灰名单风险免电核排除','frontedn_name'=>'审核通过'],
                '05'=>['id'=>'05','backend_name'=>'灰名单风险电核排除','frontedn_name'=>'审核通过'],
                '06'=>['id'=>'06','backend_name'=>'','frontedn_name'=>'审核通过']
            ],
            'active' => ['06']
        ],
        'A2'=>[
            'id'=>'A2',
            'backend_name'=>'违例通过',
            'frontedn_name'=>'违例通过',
            'child'=>[
                '01'=>['id'=>'01','backend_name'=>'信用违例，信用评分过低违例','frontedn_name'=>'审核通过'],
                '02'=>['id'=>'02','backend_name'=>'资格违例，不符合准入资格违例','frontedn_name'=>'审核通过'],
                '03'=>['id'=>'03','backend_name'=>'','frontedn_name'=>'审核通过']
            ],
            'active' => ['03']
        ],
        'A3'=>[
            'id'=>'A3',
            'backend_name'=>'机审通过',
            'frontedn_name'=>'正常通过',
            'child'=>[
                '01'=>['id'=>'01','backend_name'=>'自动初审通过','frontedn_name'=>'审核通过'],
                '02'=>['id'=>'02','backend_name'=>'自动复审通过','frontedn_name'=>'审核通过'],
                '03'=>['id'=>'03','backend_name'=>'初审转人工','frontedn_name'=>'等待审核'],
            ],
            'active' => []
        ],
        'A4'=>[
            'id'=>'A4',
            'backend_name'=>'测试通过',
            'frontedn_name'=>'正常通过',
            'child'=>[
                '01'=>['id'=>'01','backend_name'=>'','frontedn_name'=>'审核通过'],
            ],
            'active' => ['01']
        ]
    ];

    const SOURCE_ZM = 1;
    const SOURCE_MG = 2;
    const SOURCE_TD = 3;
    const SOUREC_ZZC = 4;
    const SOUREC_YXZC = 5;
    const SOUREC_HD = 6;

    public static $source_list = [
        self::SOURCE_ZM => '芝麻信用',
        self::SOURCE_MG => '蜜罐',
        self::SOURCE_TD => '同盾',
        self::SOUREC_ZZC => '中智诚',
        self::SOUREC_YXZC => '宜信致诚',
        self::SOUREC_HD => '华道征信',
    ];

    const LIST_TYPE_BLACK = 1;  //黑名单
    const LIST_TYPE_GRAY = 2;  //灰名单

    public static $list_type_list = [
        self::LIST_TYPE_BLACK => '黑名单',
        self::LIST_TYPE_GRAY => '灰名单'
    ];

    //规则map： 蜜罐以1000开头 ，芝麻以2000开头，同盾1000000开头，中智诚3000开头 宜信致诚4000开头
    //华道征信5000开头
    public static $rule_type_list = [
        1000 => '有被标记的黑名单分类', //黑名单规则：命中
        1001 => '手机和姓名在黑名单',  //黑名单规则：命中
        1002 => '身份证和姓名在黑名单', //黑名单规则：命中
        1003 => '近1个月内,机构查询次数',   //黑名单规则：≥5
        1004 => '有其他姓名使用此身份证的数量', //黑名单规则：≥1
        1201 => '注册机构数量', //灰名单规则：≥2
        1202 => '直接联系人在黑名单数量', //灰名单规则：≥1
        1203 => '近3个月内,机构查询次数',   //灰名单规则：≥3
        1204 => '近3个月内，存在使用过此手机的其他姓名的数量',  //灰名单规则:≥1
        1205 => '近3个月内，存在使用过此手机的其他身份证且的数量', //灰名单规则:≥1
        1206 => '近3个月内，存在使用过此身份证的手机数量', //灰名单规则:≥2

        2000 => '行业黑名单数量', //黑名单规则：≥1
        2201 => '最近三个月 M1 状态',
        2202 => '最近六个月 M1 状态',
        2203 => '最近一年 M1 状态',
        2204 => '最近一年 M3 状态',
        2205 => '最近一年 M6 状态',
        2206 => '最近两年 M3 状态',
        2207 => '最近两年 M6 状态',
        2208 => '最近五年 M3 状态',
        2209 => '最近五年 M6 状态',
        2210 => '最近一个月逾期总笔数',
        2211 => '最近一个月逾期总金额',
        2212 => '最近三个月逾期总笔数',
        2213 => '最近三个月逾期总金额',
        2214 => '最近六个月逾期总笔数',
        2215 => '最近六个月逾期总金额',
        2216 => '地址稳定天数',
        2217 => '最近一年使用手机号码数',
        2218 => '手机号稳定天数',
        2219 => '芝麻分',

        1000000 => '同盾分不足',
        1447348 => '身份证命中法院失信名单',
        1447372 => '身份证_姓名命中法院失信模糊名单',
        1447350 => '身份证命中犯罪通缉名单',
        1447352 => '身份证命中法院执行名单',
        1447374 => '身份证_姓名命中法院执行模糊名单',
        1447354 => '身份证号对应人存在助学贷款逾期历史',
        1447356 => '身份证命中网贷黑名单',
        1447408 => '手机号命中网贷黑名单',
        1447422 => '邮箱命中网贷黑名单',
        1447360 => '身份证命中汽车租赁黑名单',
        1447362 => '身份证命中法院结案名单',
        1447366 => '身份证命中失联名单',
        1447378 => '身份证命中公司法人失信名单',
        1447386 => '身份证命中失信还款名单',
        1447382 => '身份证命中欠税名单',
        1447358 => '身份证命中同盾欺诈高级灰名单',
        1447392 => '手机号命中同盾虚假号码库',
        1447394 => '手机号命中同盾通信小号库',
        1447396 => '手机号命中同盾诈骗骚扰库',
        1447402 => '手机号命中同盾欺诈高级灰名单',
        1447404 => '手机号命中贷款黑中介库',
        1447410 => '手机号命中汽车租赁黑名单',
        1447412 => '手机号命中公司法人失信名单',
        1447414 => '手机号命中失信还款名单',
        1447416 => '手机号命中失联名单',
        1447424 => '邮箱命中同盾欺诈高级灰名单',
        1447430 => '邮箱命中失信还款名单',
        1447468 => '地址信息命中失信名单证据库',
        1447454 => '单位名称疑似中介关键词',
        1447478 => '7天内设备或身份证或手机号申请次数过多',
        1447480 => '1个月内设备或身份证或手机号申请次数过多',
        1447482 => '1天内设备使用过多的身份证或手机号进行申请',
        1447484 => '7天内设备使用过多的身份证或手机号进行申请',
        1447486 => '1天内身份证使用过多设备进行申请',
        1447488 => '7天内身份证使用过多设备进行申请',
        1447490 => '1个月内身份证使用过多设备进行申请',
        1447494 => '1个月内申请人在多个平台申请借款',
        1447346 => '身份证归属地位于高风险较为集中地区',
        1447496 => '3个月内申请人在多个平台申请借款',
        1447528 => '第一联系人手机号命中同盾虚假号码或通信小号库_近亲',
        1447546 => '第一联系人手机号命中网贷黑名单_一般联系人',
        1447548 => '第一联系人手机号命中贷款黑中介库_一般联系人',

        3000 => '黑名单条数',

        4000 => '命中风险黑名单',
        4001 => '当前状态逾期',

        5000 => '逾期数',
        5001 => '被命中黑名单的手机号',
    ];

    public static function tableName() {
        return '{{%loan_person_bad_info}}';
    }

    /**
     * @return \yii\db\Connection the database connection used by this AR class.
     */
    public static function getDb() {
        return Yii::$app->get('db_kdkj');
    }


    public function getLoanPerson(){
        return $this->hasOne(LoanPerson::className(), ['id' => 'person_id']);
    }

}
