<div class="extension">
  <style>body{background:#f2f2f2;}</style>
  <div class="info">
    <p>1. 适用对象<br/>
      适用于在到期还款日，因为资金不足而无法正常还款的用户。<br/>比如，小明的还款日是2016年11月11日，还款金额是1000.00元。但是当前可用活期资金为500.00元。此时小明可以申请续期服务。将还款期限延后几天。等资金充裕再完成还款。</p>
    <p>2.相关费用<br/>
      目前续期服务所收费用由三部分组成：服务费、续期费、逾期费。<br/>
      服务费：即一笔借款延期一个借款周期的费用。即一个借款周期所需的费用；<br/>
      续期费：申请续期服务所需的服务费用；<br/>
      逾期费：即申请续期服务时该笔借款当前产生的逾期费用，申请续期服务的时候需要优先结算掉。<br/>
    <p>3.续期次数<br/>
      目前借款所允许的续期服务次数为3次。以平台最新官方公告为准。</p>
  </div>
</div>