<?php

use yii\helpers\Url;
?>
<div class="reg-agreement">
      <div class="reg-wrap">
        <h1>运营商信息授权协议</h1>
        <p><?php echo $company?>在此郑重提示您，本文系您与“<?php echo $app_name?>”（以下简称平台）之间的法律协议，请您认真阅读并理解本协议。您通过平台点击确认本协议的，即表示您同意遵循本协议的所有约定，本协议在您和平台之间具有法律约束力。如发生法律纠纷，您不得以未仔细阅读或理解本协议为由进行抗辩。</p>
        <h3>一、授权事项</h3>
        <p>用户需不可撤销地授权平台查看、储存用户的手机运营商信息，包括但不限于用户身份信息、是否实名认证、通话记录及通讯录信息等在内的各类型信息。一旦用户选择接受平台所提供的任何服务事项，即视为用户同意给予平台上述授权。</p>
        <h3>二、信息保密</h3>
        <p>平台应当采取不低于一般行业惯例对于通过用户之授权所获取的信息进行保护，并以一切商业上的合理努力确保这些用户信息的安全。</p>
        <p>通常，平台员工或与平台合作的第三方并不会查看在平台系统中存储的用户信息，但当平台得知平台产品及服务条款可能已被用户违反并且需要平台采取一定的补救措施时，平台有权依照法律法规及按照平台与用户之间的约定采取恰当措施查询、使用这些用户信息。</p>
        <p>基于防火墙或其他安全软件可能发生故障，或按照当前商业上可以采取的安全手段也难以避免或及时消除的故障及破坏，将可能导致用户信息遭到外部访问、窃取或删除，此等情形下平台不承担相应的责任。</p>
        <p>因不可抗力所导致的用户信息泄露（包含但不限于黑客攻击、第三方导致的系统缺陷等），平台不承担相应的责任。</p>
        <h3>三、例外情形</h3>
        <p>出现下列情形之一的，平台可向外部第三方公开平台所获取的用户信息</p>
        <p>1.基于用户的同意或授权。</p>
        <p>2.出于用户对产品及服务的需求。</p>
        <p>3.出于履行平台的法定义务，为了预防、调查非法活动，保护社会或他人人身、财产安全，所必须向有关司法、行政机关履行之报告义务。</p>
        <p>4.基于用户违反平台相关产品及服务的规则，平台基于法定或与第三方之间的约定就用户的违约行为履行相应的报告义务。</p>
        <p>5.平台因用户违反平台相关产品及服务的规则，基于维护自身合法权益的需要，向第三方披露用户的相关信息，从而保障平台合法权益之目的。</p>
        <p>6.根据法律规定及合理的商业习惯，平台在计划与其他公司进行合并或进行其他资本市场活动时（包括但不限于股权融资、债券发行等），以及其他情形下我们需要接受其他主体的尽职调查时，我们可能会将通过用户授权所获取的信息提供给相应的主体。平台会通过与相关主体签订保密协议的形式以及其他商业上合理的手段要求相关主体对于用户信息加以保密。</p>
        <h3>四、关于电子合同</h3>
        <p>本协议采用电子文本形式制成，并在平台系统上保留存档。其签订方式符合《中华人民共和国电子签名法》的要求。用户通过平台系统点击确认或以其他方式选择接受本协议，即表示已同意接受本协议的全部内容以及与本协议有关的各项平台规则。</p>
        <p>用户应当妥善保管自己的账号、密码等账户信息，不得以账户信息被盗用或其他理由否认已订立的协议的效力或不履行相关义务。</p>
        <h3>五、其他</h3>
        <p>本协议未尽事项按照平台现有及不时发布的各项规则执行。</p>
        <p>如本协议中的任何一条或多条被确认为无效，该无效条款并不影响本协议其他条款的效力。</p>
      </div>
    </div>