<?php
use yii\helpers\Url;

?>
<div class="reg-agreement">
      <div class="reg-wrap">
        <h1>信息授权及使用协议</h1>
        <p><?php echo COMPANY_NAME;?>在此郑重提示您，本文系您与“<?php echo APP_NAMES;?>”（以下简称平台）之间的法律协议，请您认真阅读并理解本协议。您通过平台点击确认本协议的，即表示您同意遵循本协议的所有约定，本协议在您和平台之间具有法律约束力。如发生法律纠纷，您不得以未仔细阅读或理解本协议为由进行抗辩。
        </p>
        <p>基于为用户尽可能提供高水平产品及服务之目的，用户在使用、购买平台产品及服务或与平台员工进行交流的过程中，随时可能涉及到平台对用户个人信息的收集、使用及披露。用户授权平台收集、使用并储存相应的用户个人信息是平台为用户提供相应产品及服务的前提。</p>
        <h2>一．用户信息收集及使用的范围</h2>
          <p>1.用户姓名、地址、联系方式等个人信息，以及用户为使用平台服务所涉及的银行账户等信息。</p>
          <p>2.用户的当前职业、位置等信息，以便平台对用户需求的理解及维护。</p>
          <p>3.基于用户授权或中国人民共和国现有之法律法规规定，平台通过依法设立的征信数据机构所获取的包含用户信用行为及信用历史记录在内的各类型用户行为分析及个人信息，以便平台作为向用户提供产品及服务的依据。</p>
        <h2>二．出现下列情形之一的，平台可向外部第三方公开平台所获取的用户信息</h2>
          <p>1.基于用户的同意或授权。</p>
          <p>2.出于用户对产品及服务的需求。 </p>
          <p>3.出于履行平台的法定义务，为了预防、调查非法活动，保护社会或他人人身、财产安全，所必须向有关司法、行政机关履行之报告义务。</p>
          <p>4.基于用户违反平台相关产品及服务的规则，平台基于法定或与第三方之间的约定就用户的违约行为履行相应的报告义务。 </p>
          <p>5.平台因用户违反平台相关产品及服务的规则，基于维护自身合法权益的需要，向第三方披露用户的相关信息，从而保障平台合法权益之目的。</p>
        <h2>三．用户信息的存储及责任限制</h2>
          <p>平台应当采取不低于一般行业惯例对于用户的资料及信息进行保护，并以一切商业上的合理努力确保这些用户信息的安全。</p>
          <p>通常，平台员工或与平台合作的第三方并不会查看在平台系统中存储的用户信息及交易数据，但当平台得知平台产品及服务条款可能已被用户违反并且需要平台采取一定的补救措施时，平台有权依照法律法规及按照平台与用户之间的约定采取恰当措施查询、使用这些用户信息及交易数据。</p>
          <p>基于防火墙或其他安全软件可能发生故障，或按照当前商业上可以采取的安全手段也难以避免或及时消除的故障及破坏，将可能导致用户信息遭到外部访问、窃取或删除，此等情形下平台不承担相应的责任。</p>
          <p>因不可抗力所导致的用户资料及信息泄露（包含但不限于黑客攻击、第三方导致的系统缺陷等），平台不承担相应的责任。</p>
        <h2>四．关于电子合同</h2>  
          <p>本协议采用电子文本形式制成，并在平台系统上保留存档。其签订方式符合《中华人民共和国电子签名法》的要求。用户通过平台系统点击确认或以其他方式选择接受本协议，即表示已同意接受本协议的全部内容以及与本协议有关的各项平台规则。</p>
          <p>用户应当妥善保管自己的账号、密码等账户信息，不得以账户信息被盗用或其他理由否认已订立的协议的效力或不履行相关义务。</p>
        <h2>五．其他</h2>  
          <p>本协议未尽事项按照平台现有及不时发布的各项规则执行。</p>
          <p>如本协议中的任何一条或多条被确认为无效，该无效条款并不影响本协议其他条款的效力。</p>
      </div>
    </div>