<body>
	<style>
		body {
			background-color: #f2f2f2;
		}
	</style>
	<div class="use-instruction">
		<h3>1. 什么是优惠券？</h3>
		<p>优惠券是<?php echo APP_NAMES;?>发行和认可的抵用现金券，可在<?php echo APP_NAMES;?>借款和还款时使用，满足使用条件时可抵扣相应的金额。</p>
		<h3>2. 如何获得优惠券？</h3>
		<p><?php echo APP_NAMES;?>会在线上不定期举办活动，在活动期间申请借款，有可能获得领取优惠券的机会，并非所有申请借款的用户都会获得优惠券。</p>
		<h3>3. 优惠券的使用条件有哪些？</h3>
		<p>优惠券仅限有效期内使用；对于满足使用条件的订单方可使用；每个优惠券仅限使用一次，不能分开使用。</p>
		<h3>4. 什么是现金红包？</h3>
		<p>现金红包由<?php echo APP_NAMES;?>进行发放，在领取后24小时内发放至用户绑定的银行卡。</p>
		<h3>5. 如何获得现金红包？</h3>
		<p><?php echo APP_NAMES;?>会在线上不定期举办活动，在活动期间申请借款，有可能获得领取现金红包的机会，并非所有申请借款的用户都会获得现金红包。</p>
	</div>
</body>