<div class="reg-agreement">
      <div class="reg-wrap">
        <h1>还款代扣协议</h1>
        <p><?php echo COMPANY_NAME; ?>在此郑重提示您，本文系您与“<?php echo APP_NAMES;?>”（以下简称 “平台” 或 “乙方”）之间的法律协议，请您认真阅读并理解本协议。您通过平台点击确认本协议的，即表示您同意遵循本协议的所有约定，本协议在您和平台之间具有法律约束力。如发生法律纠纷，您不得以未仔细阅读或理解本协议为由进行抗辩。</p>
        <h2>第一条  甲方授权</h2>
        <p>1.1 甲方实名注册乙方“<?php echo APP_NAMES;?>”账号，并绑定本人合法所有的银行卡是甲方申请“<?php echo APP_NAMES;?>”服务的前提。</p>
        <p>甲方信息：</p>
        <p>姓名： <?php echo $data['name']; ?></p>
        <p>身份证号： <?php echo $data['id_number']; ?></p>
        <p>绑定银行卡卡号： <?php echo $data['bank_id']; ?></p>
        <p>1.2 甲方在此不可撤销地授权乙方根据双方签订的《借款协议》所约定的还款日期、还款金额，在还款日届满后从甲方平台账号所绑定银行卡中的金额中扣除其当期应还款金额。</p>
        <h2>第二条  甲方承诺</h2>
        <p>2.1 甲方承诺按照《借款与服务协议》约定的还款日期，还款金额及时履行还款义务；甲方承诺在还款日届满前确保甲方授权代扣的银行卡中的余额足以支付甲方所应还款的金额。</p>
        <p>2.2 甲方在借款期间如发生迁往异地、工作调动、通讯地址及联系电话变更等情形，应及时书面通知乙方。甲方在借款期间未经乙方允许不得变更、注销甲方平台账号所绑定的银行卡。</p>
        <h2>第三条  代扣备注</h2>
        <p>3.1 甲方提出服务申请并确认本协议内容，即授权乙方代为从甲方平台账号所绑定的银行卡中代为扣除甲方应还款金额。</p>
        <p>3.2 乙方将于约定还款日进行扣款，甲方请勿采取其他方式另行还款以免重复。乙方仅提供全额还款代扣操作（即在还款日对于当期应还款项进行全额扣款）。如因甲方平台账号所绑定的银行卡中的余额不足导致未能进行还款代扣操作的，乙方有权在非还款日继续进行还款代扣操作，且甲方应当按照《借款协议》的约定承担逾期利息或违约责任。</p>
        <p>3.3 如甲方发生逾期还款，乙方有权在非还款日对于甲方平台账号所绑定的银行卡中的金额进行代扣，直至甲方偿还完毕全部逾期还款金额、逾期利息或违约金及其他费用。</p>
        <p>3.4 乙方代扣甲方款项将按照甲方逾期还款金额逾期利息或违约金及其他费用的顺序进行。</p>
        <h2>第四条  违约责任</h2>
        <p>甲方未按照本协议履行造成乙方损失的，甲方需承担相应的违约责任。</p>
        <h2>第五条  适用法律及争议解决</h2>
        <p>5.1本协议的签订、履行、终止、解释均适用中华人民共和国法律。</p>
        <p>5.2因履行本协议所产生的争议应当通过友好协商解决；如协商不成，则本协议任意一方均可向乙方所在地<?php echo COMPANY_AREA;?>有管辖权的人民法院起诉</p>
      </div>
    </div>